_posts/language/2016-09-04-english-pea.html
---
layout: post
title: 单词本：蔬菜之豆豆
categories: [language]
tags: [English]
---

<p>
上一篇我们一起学习了各种瓜瓜的名字，这篇再来一起学一学各种豆豆。
</p>

<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7"><span class="section-number-2">1</span> pea</h2>
<div class="outline-text-2" id="text-1">
<p>
pea 是豌豆的名字：
</p>
<ul class="org-ul">
<li>Every Sunday, dad made a beautiful pean and ham soup. 每周日晚上老爸会做美味的豌豆火腿汤。</li>
</ul>

<p>
豌豆是豆类的一种，英语中豆类叫 legume，而法语中 le légume<sup>(fr)</sup> 其实是蔬菜的统称。这个在之前的文章中有介绍（<a href="http://kimi.im/2016-08-16-english-vegetable">August 16, 2016 » 单词本：蔬菜</a>）。我们是不是可以这样认为，英国人的豆类在法国人看来是蔬菜的代表性品种。
</p>
</div>

<div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> pea pod</h3>
<div class="outline-text-3" id="text-1-1">
<p>
豌豆荚。iPod 是指某种智能豆荚吗？la cosse<sup>(fr)</sup>，die Schote<sup>(de)</sup>。
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">1.2</span> cowpea</h3>
<div class="outline-text-3" id="text-1-2">
<p>
豇豆，直译是牛豆。这是为什么呢？是牛喜欢吃吗？
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">1.3</span> suger pea</h3>
<div class="outline-text-3" id="text-1-3">
<p>
甜豆。大概是豌豆的一种，趁嫩的时候吃，口味甜甜的。
</p>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">1.4</span> snow pea</h3>
<div class="outline-text-3" id="text-1-4">
<p>
荷兰豆。豆荚扁扁的，连豆荚一起炒着吃的。
</p>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">1.5</span> like two peas in a pod</h3>
<div class="outline-text-3" id="text-1-5">
<p>
就像同一个豆荚里的俩豌豆，形容两个事物长的很像。
</p>
<ul class="org-ul">
<li>Doris and Flora are inseparable and they're like two peas in a pod. 多丽丝和福罗拉总是不分开，就像一个豆荚里的两个豌豆。</li>
<li>You can tell they're brothers at a glance - they're like two peas in a pod. 你一眼就能看出他俩是兄弟，他们就像一个豌豆荚里的两颗豌豆。</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6"><span class="section-number-3">1.6</span> peabrain</h3>
<div class="outline-text-3" id="text-1-6">
<p>
“没脑子”的不太文明的说法。
</p>
<ul class="org-ul">
<li>You're always knocking things over you stupid, stupid peabrain.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline13" class="outline-2">
<h2 id="orgheadline13"><span class="section-number-2">2</span> bean</h2>
<div class="outline-text-2" id="text-2">
<p>
另外一种豆。比豌豆要大一些的另外一种豆。说实话，像我这样稻谷不分的人，真的不知道豌豆类豆子和大豆类豆子有什么差别。只能大概猜测一下，bean 应该是大黄豆这样的大豆子，而 pea 则是圆圆的小豌豆，小甜豆那一类的豆子。
</p>
</div>

<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8"><span class="section-number-3">2.1</span> soybean</h3>
<div class="outline-text-3" id="text-2-1">
<p>
大豆。soy 酱油。也许因为主要用来做酱油，所以取名叫 soybean。
</p>
</div>
</div>

<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9"><span class="section-number-3">2.2</span> young soybean</h3>
<div class="outline-text-3" id="text-2-2">
<p>
毛豆。年轻的大豆。
</p>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10"><span class="section-number-3">2.3</span> broad bean</h3>
<div class="outline-text-3" id="text-2-3">
<p>
蚕豆。豆子扁扁宽宽的，所以就叫“宽豆”。
</p>
</div>
</div>

<div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11"><span class="section-number-3">2.4</span> haricot bean</h3>
<div class="outline-text-3" id="text-2-4">
<p>
扁豆，四季豆。
</p>
</div>
</div>

<div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12"><span class="section-number-3">2.5</span> sword bean</h3>
<div class="outline-text-3" id="text-2-5">
<p>
刀豆。
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline14" class="outline-2">
<h2 id="orgheadline14"><span class="section-number-2">3</span> Summary</h2>
<div class="outline-text-2" id="text-3">
<p>
说实在的，有关豆子的名词有些难到我了，因为我平时吃豆子真的不太关心豆子分别叫什么名字。不过系统的学了一下之后，渐渐还是有一些清晰直观的感受了。
</p>
</div>
</div>
